Revit 2027 API
BendingDetailCustomFieldProperties.AngularDimensionTypeId Property
 Identifies the Id of the angular dimension type which is used to show dimensions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AngularDimensionTypeId { get; set; }
Public Property AngularDimensionTypeId As ElementId
	Get
	Set
public:
property ElementId^ AngularDimensionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member AngularDimensionTypeId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The angularDimensionTypeId should be an id of an angular dimension type.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace